In [72]:
## ALl import we need in our case study
import os
import pandas as pd
import numpy as np
import sqlite3

In [73]:
## specify where we save our data
data_dir = os.path.join("..", "data")

In [74]:
## Build Function to Connect to Database
def connect_db(file_path):
    try:
        conn = sqlite3.connect(file_path)
        print("..successfully connected to db\n")
    except Error as e:
        print("..failed connection\n", e)
    
    return(conn)

In [75]:
## make connection to db using connect_db function
conn = connect_db(os.path.join(data_dir, "aavail-customers.db"))

..successfully connected to db

In [76]:
## print tables names
tables = [t[0] for t in conn.execute("SELECT name FROM sqlite_master WHERE type='table';")]
print(tables)

['CUSTOMER', 'INVOICE', 'INVOICE_ITEM', 'COUNTRY']

In [77]:
df_customer = pd.read_sql_query("SELECT customer_id FROM CUSTOMER", conn)

print(df_customer)

      customer_id
0               1
1               2
2               3
3               4
4               5
...           ...
1002           21
1003           31
1004          301
1005          401
1006          801

[1007 rows x 1 columns]

In [78]:
df_customer = pd.read_sql_query("SELECT last_name FROM CUSTOMER", conn)

df_customer.head()

     last_name
0         Todd
1        Garza
2        Carey
3  Christensen
4       Gibson

In [79]:
df_customer = pd.read_sql_query("SELECT first_name FROM CUSTOMER", conn)

df_customer.head()

  first_name
0      Kasen
1     Ensley
2    Lillian
3       Beau
4    Ernesto

In [80]:
df_customer = pd.read_sql_query("SELECT DOB FROM CUSTOMER", conn)

df_customer.head()

        DOB
0  07/30/98
1  04/12/89
2  09/12/97
3  01/28/99
4  03/23/98

In [81]:
df_customer = pd.read_sql_query("SELECT City FROM CUSTOMER", conn)

df_customer.head()

        city
0  Rock Hill
1  singapore
2     Auburn
3  Hempstead
4  singapore

In [82]:
df_customer = pd.read_sql_query("SELECT State FROM CUSTOMER", conn)

df_customer.head()

            state
0  South Carolina
1            None
2         Alabama
3        New York
4            None

In [83]:
df_customer = pd.read_sql_query("SELECT country_name FROM COUNTRY as co, CUSTOMER as cu WHERE co.country_id = cu.country_id ", conn)

df_customer.tail()

       country_name
1002  united_states
1003  united_states
1004  united_states
1005  united_states
1006  united_states

In [84]:
df_customer = pd.read_sql_query("SELECT gender FROM CUSTOMER", conn)

df_customer.head()

  gender
0      m
1      f
2      f
3      m
4      m

In [85]:
# extract the relevant data from the DB
# Query the database and extract the following data into a Pandas DataFrame.

# - Customer ID (integer)
# - Last name
# - First name
# - DOB (Date Of Birth)
# - City
# - State
# - Country (the name NOT the country_id)
# - Gender

In [86]:
df_customer = pd.read_sql_query("SELECT cu.customer_id, cu.last_name, cu.first_name, cu.DOB, cu.City, cu.State, " + 
                                "co.country_name, cu.gender FROM CUSTOMER as cu JOIN COUNTRY as co ON cu.country_id = co.country_id", conn)

df_customer.head()

,customer_id,last_name,first_name,DOB,city,state,country_name,gender
0,1,Todd,Kasen,07/30/98,Rock Hill,South Carolina,united_states,m
1,2,Garza,Ensley,04/12/89,singapore,None,singapore,f
2,3,Carey,Lillian,09/12/97,Auburn,Alabama,united_states,f
3,4,Christensen,Beau,01/28/99,Hempstead,New York,united_states,m
4,5,Gibson,Ernesto,03/23/98,singapore,None,singapore,m

In [87]:
# For each customer_id determine if a customer has stopped their subscription or not and save it in a dictionary or another data container.

In [88]:
df_streams = pd.read_csv(os.path.join(data_dir, r"aavail-streams.csv"))

df_streams.tail()

,customer_id,stream_id,date,invoice_item_id,subscription_stopped
18854,1000,1729.0,2019-07-01,3.0,0
18855,1000,1527.0,2019-07-10,3.0,0
18856,1000,1254.0,2019-07-10,3.0,0
18857,1000,1356.0,2019-07-12,3.0,0
18858,1000,1219.0,2019-07-13,3.0,0

In [89]:
df_streams.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18859 entries, 0 to 18858
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   customer_id           18859 non-null  int64
 1   stream_id             17695 non-null  float64
 2   date                  18859 non-null  object
 3   invoice_item_id       18859 non-null  float64
 4   subscription_stopped  18859 non-null  int64
dtypes: float64(2), int64(2), object(1)
memory usage: 736.8+ KB

In [90]:
grouped = df_streams.groupby("customer_id")["subscription_stopped"].any()

result = grouped.to_dict()

result

{1: False,
 2: True,
 3: True,
 4: False,
 5: False,
 6: False,
 7: True,
 8: False,
 9: True,
 10: True,
 11: False,
 12: True,
 13: False,
 14: False,
 15: True,
 16: False,
 17: False,
 18: True,
 19: False,
 20: False,
 21: True,
 22: True,
 23: False,
 24: True,
 25: False,
 26: False,
 27: False,
 28: False,
 29: False,
 30: False,
 31: False,
 32: True,
 33: False,
 34: True,
 35: True,
 36: True,
 37: False,
 38: False,
 39: True,
 40: False,
 41: False,
 42: True,
 43: False,
 44: False,
 45: False,
 46: False,
 47: False,
 48: False,
 49: False,
 50: False,
 51: False,
 52: False,
 53: True,
 54: False,
 55: False,
 56: False,
 57: False,
 58: True,
 59: False,
 60: False,
 61: True,
 62: False,
 63: True,
 64: False,
 65: False,
 66: False,
 67: False,
 68: True,
 69: True,
 70: True,
 71: False,
 72: False,
 73: False,
 74: False,
 75: False,
 76: False,
 77: True,
 78: False,
 79: True,
 80: True,
 81: True,
 82: False,
 83: False,
 84: False,
 85: False,
 86: True,
 87: True,
 88: False,
 89: False,
 90: False,
 91: True,
 92: False,
 93: True,
 94: False,
 95: False,
 96: False,
 97: True,
 98: True,
 99: False,
 100: True,
 101: True,
 102: False,
 103: False,
 104: False,
 105: False,
 106: False,
 107: False,
 108: False,
 109: True,
 110: False,
 111: False,
 112: False,
 113: True,
 114: False,
 115: False,
 116: True,
 117: True,
 118: True,
 119: False,
 120: True,
 121: True,
 122: False,
 123: False,
 124: False,
 125: True,
 126: False,
 127: False,
 128: False,
 129: True,
 130: False,
 131: False,
 132: False,
 133: True,
 134: False,
 135: False,
 136: False,
 137: True,
 138: False,
 139: False,
 140: False,
 141: True,
 142: False,
 143: True,
 144: False,
 145: False,
 146: False,
 147: False,
 148: True,
 149: True,
 150: True,
 151: False,
 152: False,
 153: False,
 154: False,
 155: False,
 156: False,
 157: True,
 158: False,
 159: True,
 160: True,
 161: False,
 162: False,
 163: False,
 164: False,
 165: False,
 166: False,
 167: False,
 168: True,
 169: False,
 170: False,
 171: False,
 172: False,
 173: False,
 174: True,
 175: False,
 176: False,
 177: False,
 178: False,
 179: True,
 180: False,
 181: True,
 182: False,
 183: True,
 184: False,
 185: False,
 186: False,
 187: False,
 188: False,
 189: False,
 190: True,
 191: False,
 192: False,
 193: False,
 194: False,
 195: True,
 196: False,
 197: True,
 198: True,
 199: False,
 200: False,
 201: False,
 202: False,
 203: False,
 204: False,
 205: False,
 206: True,
 207: False,
 208: False,
 209: False,
 210: False,
 211: False,
 212: False,
 213: False,
 214: False,
 215: False,
 216: True,
 217: True,
 218: False,
 219: False,
 220: True,
 221: False,
 222: True,
 223: False,
 224: False,
 225: False,
 226: False,
 227: True,
 228: False,
 229: False,
 230: False,
 231: True,
 232: False,
 233: True,
 234: False,
 235: False,
 236: False,
 237: False,
 238: False,
 239: False,
 240: False,
 241: True,
 242: True,
 243: True,
 244: False,
 245: False,
 246: False,
 247: False,
 248: True,
 249: False,
 250: True,
 251: True,
 252: True,
 253: False,
 254: False,
 255: False,
 256: True,
 257: False,
 258: False,
 259: True,
 260: True,
 261: False,
 262: False,
 263: True,
 264: False,
 265: True,
 266: False,
 267: True,
 268: False,
 269: False,
 270: False,
 271: False,
 272: False,
 273: False,
 274: False,
 275: False,
 276: False,
 277: False,
 278: False,
 279: True,
 280: False,
 281: False,
 282: False,
 283: True,
 284: True,
 285: False,
 286: False,
 287: False,
 288: False,
 289: False,
 290: False,
 291: False,
 292: True,
 293: False,
 294: False,
 295: False,
 296: False,
 297: False,
 298: True,
 299: False,
 300: False,
 301: True,
 302: True,
 303: False,
 304: True,
 305: True,
 306: False,
 307: False,
 308: False,
 309: False,
 310: True,
 311: False,
 312: True,
 313: True,
 314: True,
 315: False,
 316: True,
 317: False,
 318: False,
 319: True,
 320: True,
 321: False,
 322: False,
 323: False,
 324: False,
 325: False,
 326: False,
 327: False,
 328: True,
 329: False,
 330: False,
 331: False,
 332: False,
 333: False,
 334: False,
 335: True,
 336: True,
 337: False,
 338: False,
 339: False,
 340: True,
 341: False,
 342: False,
 343: False,
 344: True,
 345: True,
 346: False,
 347: True,
 348: False,
 349: False,
 350: False,
 351: False,
 352: True,
 353: False,
 354: False,
 355: False,
 356: False,
 357: False,
 358: True,
 359: False,
 360: False,
 361: False,
 362: False,
 363: False,
 364: False,
 365: True,
 366: True,
 367: True,
 368: False,
 369: False,
 370: False,
 371: False,
 372: True,
 373: False,
 374: False,
 375: True,
 376: False,
 377: False,
 378: False,
 379: True,
 380: False,
 381: False,
 382: False,
 383: False,
 384: False,
 385: True,
 386: False,
 387: False,
 388: False,
 389: False,
 390: False,
 391: False,
 392: False,
 393: False,
 394: True,
 395: True,
 396: False,
 397: False,
 398: True,
 399: False,
 400: False,
 401: False,
 402: False,
 403: False,
 404: False,
 405: False,
 406: False,
 407: False,
 408: True,
 409: True,
 410: False,
 411: True,
 412: False,
 413: True,
 414: False,
 415: False,
 416: False,
 417: False,
 418: False,
 419: False,
 420: False,
 421: False,
 422: True,
 423: False,
 424: True,
 425: True,
 426: False,
 427: False,
 428: False,
 429: True,
 430: True,
 431: False,
 432: False,
 433: True,
 434: False,
 435: False,
 436: True,
 437: True,
 438: True,
 439: False,
 440: False,
 441: False,
 442: False,
 443: False,
 444: False,
 445: False,
 446: False,
 447: False,
 448: False,
 449: False,
 450: False,
 451: False,
 452: False,
 453: True,
 454: True,
 455: False,
 456: True,
 457: False,
 458: False,
 459: False,
 460: False,
 461: False,
 462: False,
 463: False,
 464: False,
 465: False,
 466: False,
 467: True,
 468: True,
 469: False,
 470: False,
 471: False,
 472: False,
 473: True,
 474: False,
 475: True,
 476: False,
 477: False,
 478: False,
 479: False,
 480: False,
 481: True,
 482: False,
 483: False,
 484: True,
 485: False,
 486: False,
 487: False,
 488: True,
 489: True,
 490: True,
 491: True,
 492: False,
 493: False,
 494: True,
 495: True,
 496: False,
 497: False,
 498: False,
 499: False,
 500: False,
 501: False,
 502: False,
 503: True,
 504: False,
 505: False,
 506: False,
 507: True,
 508: False,
 509: True,
 510: False,
 511: False,
 512: False,
 513: False,
 514: False,
 515: False,
 516: False,
 517: True,
 518: True,
 519: False,
 520: False,
 521: False,
 522: False,
 523: False,
 524: False,
 525: False,
 526: False,
 527: False,
 528: True,
 529: False,
 530: True,
 531: False,
 532: False,
 533: False,
 534: False,
 535: False,
 536: False,
 537: False,
 538: False,
 539: True,
 540: False,
 541: False,
 542: False,
 543: True,
 544: True,
 545: True,
 546: False,
 547: False,
 548: False,
 549: True,
 550: True,
 551: True,
 552: True,
 553: False,
 554: True,
 555: False,
 556: False,
 557: False,
 558: True,
 559: False,
 560: False,
 561: True,
 562: False,
 563: True,
 564: False,
 565: False,
 566: False,
 567: False,
 568: False,
 569: True,
 570: False,
 571: True,
 572: True,
 573: False,
 574: True,
 575: False,
 576: False,
 577: True,
 578: True,
 579: False,
 580: True,
 581: False,
 582: False,
 583: False,
 584: False,
 585: False,
 586: False,
 587: False,
 588: False,
 589: False,
 590: False,
 591: False,
 592: False,
 593: False,
 594: False,
 595: True,
 596: False,
 597: False,
 598: False,
 599: False,
 600: False,
 601: False,
 602: False,
 603: True,
 604: False,
 605: False,
 606: False,
 607: False,
 608: False,
 609: False,
 610: True,
 611: False,
 612: False,
 613: False,
 614: False,
 615: False,
 616: True,
 617: False,
 618: True,
 619: True,
 620: False,
 621: False,
 622: False,
 623: False,
 624: False,
 625: True,
 626: False,
 627: False,
 628: False,
 629: False,
 630: False,
 631: True,
 632: True,
 633: True,
 634: False,
 635: False,
 636: True,
 637: False,
 638: True,
 639: False,
 640: True,
 641: False,
 642: False,
 643: True,
 644: False,
 645: True,
 646: True,
 647: False,
 648: True,
 649: False,
 650: True,
 651: False,
 652: True,
 653: False,
 654: False,
 655: False,
 656: False,
 657: True,
 658: False,
 659: False,
 660: True,
 661: False,
 662: False,
 663: False,
 664: False,
 665: False,
 666: False,
 667: False,
 668: False,
 669: True,
 670: False,
 671: False,
 672: False,
 673: True,
 674: False,
 675: False,
 676: True,
 677: False,
 678: True,
 679: False,
 680: False,
 681: False,
 682: False,
 683: False,
 684: False,
 685: True,
 686: False,
 687: False,
 688: True,
 689: False,
 690: False,
 691: True,
 692: False,
 693: True,
 694: False,
 695: False,
 696: True,
 697: True,
 698: True,
 699: False,
 700: False,
 701: False,
 702: False,
 703: False,
 704: True,
 705: True,
 706: False,
 707: True,
 708: False,
 709: False,
 710: False,
 711: False,
 712: False,
 713: False,
 714: True,
 715: False,
 716: True,
 717: True,
 718: True,
 719: True,
 720: False,
 721: True,
 722: False,
 723: True,
 724: True,
 725: False,
 726: False,
 727: True,
 728: False,
 729: False,
 730: False,
 731: False,
 732: False,
 733: False,
 734: False,
 735: False,
 736: True,
 737: False,
 738: True,
 739: False,
 740: True,
 741: False,
 742: False,
 743: False,
 744: True,
 745: False,
 746: True,
 747: True,
 748: False,
 749: True,
 750: False,
 751: True,
 752: False,
 753: False,
 754: False,
 755: False,
 756: True,
 757: False,
 758: False,
 759: True,
 760: True,
 761: True,
 762: True,
 763: False,
 764: False,
 765: True,
 766: False,
 767: False,
 768: True,
 769: False,
 770: False,
 771: False,
 772: False,
 773: False,
 774: False,
 775: False,
 776: False,
 777: False,
 778: False,
 779: False,
 780: True,
 781: False,
 782: False,
 783: False,
 784: False,
 785: False,
 786: False,
 787: False,
 788: False,
 789: False,
 790: False,
 791: True,
 792: False,
 793: False,
 794: False,
 795: True,
 796: False,
 797: False,
 798: False,
 799: False,
 800: False,
 801: True,
 802: False,
 803: False,
 804: False,
 805: False,
 806: True,
 807: False,
 808: False,
 809: True,
 810: False,
 811: False,
 812: True,
 813: False,
 814: False,
 815: True,
 816: False,
 817: True,
 818: False,
 819: True,
 820: False,
 821: True,
 822: True,
 823: False,
 824: False,
 825: False,
 826: False,
 827: False,
 828: False,
 829: True,
 830: False,
 831: True,
 832: False,
 833: False,
 834: True,
 835: True,
 836: False,
 837: False,
 838: False,
 839: False,
 840: True,
 841: True,
 842: True,
 843: False,
 844: False,
 845: False,
 846: True,
 847: False,
 848: False,
 849: False,
 850: False,
 851: True,
 852: False,
 853: False,
 854: False,
 855: True,
 856: False,
 857: False,
 858: True,
 859: True,
 860: False,
 861: True,
 862: False,
 863: False,
 864: True,
 865: False,
 866: False,
 867: False,
 868: False,
 869: False,
 870: True,
 871: True,
 872: False,
 873: False,
 874: False,
 875: True,
 876: True,
 877: False,
 878: False,
 879: True,
 880: False,
 881: False,
 882: False,
 883: False,
 884: True,
 885: False,
 886: True,
 887: False,
 888: True,
 889: True,
 890: False,
 891: False,
 892: False,
 893: False,
 894: False,
 895: False,
 896: True,
 897: False,
 898: False,
 899: False,
 900: False,
 901: False,
 902: True,
 903: False,
 904: False,
 905: False,
 906: False,
 907: True,
 908: False,
 909: True,
 910: False,
 911: False,
 912: False,
 913: True,
 914: False,
 915: False,
 916: False,
 917: True,
 918: False,
 919: False,
 920: True,
 921: True,
 922: False,
 923: False,
 924: False,
 925: False,
 926: False,
 927: False,
 928: False,
 929: True,
 930: False,
 931: False,
 932: False,
 933: False,
 934: False,
 935: False,
 936: False,
 937: True,
 938: True,
 939: False,
 940: False,
 941: False,
 942: False,
 943: True,
 944: False,
 945: True,
 946: False,
 947: False,
 948: False,
 949: True,
 950: True,
 951: False,
 952: False,
 953: False,
 954: False,
 955: False,
 956: False,
 957: False,
 958: False,
 959: False,
 960: False,
 961: False,
 962: False,
 963: False,
 964: False,
 965: False,
 966: False,
 967: False,
 968: False,
 969: False,
 970: True,
 971: False,
 972: False,
 973: False,
 974: False,
 975: True,
 976: False,
 977: False,
 978: True,
 979: False,
 980: True,
 981: False,
 982: False,
 983: False,
 984: False,
 985: False,
 986: False,
 987: False,
 988: False,
 989: False,
 990: False,
 991: False,
 992: True,
 993: False,
 994: False,
 995: False,
 996: True,
 997: False,
 998: False,
 999: False,
 1000: False}

In [91]:
len(result) # should be number of customers

1000

In [92]:
list(result.items())[:6]       # sanity check

[(1, False), (2, True), (3, True), (4, False), (5, False), (6, False)]

In [93]:
# Implement checks for quality assurance

# 1. In the customer dataframe loaded question 1, remove any repeat customers based on customer_id
# 2. In the streams dataset, remove stream data that do not have an associated stream_id
# 3. Check for missing values in both datasets.

In [94]:
df_customer = df_customer.drop_duplicates(subset="customer_id", keep="first")

df_customer.tail()

,customer_id,last_name,first_name,DOB,city,state,country_name,gender
995,996,Enriquez,Peyton,12/08/64,singapore,None,singapore,m
996,997,Manning,Amina,08/06/96,Dublin,California,united_states,f
997,998,Ventura,Brooks,01/26/95,St. Clair Shores,Michigan,united_states,m
998,999,Mathis,Nayeli,01/28/80,Pleasant Grove,Utah,united_states,f
999,1000,Solis,Cole,07/07/99,Brockton,Massachusetts,united_states,m

In [95]:
df_streams = df_streams[df_streams["stream_id"].notna()]
df_streams

,customer_id,stream_id,date,invoice_item_id,subscription_stopped
0,1,1420.0,2018-10-21,2.0,0
1,1,1343.0,2018-10-23,2.0,0
2,1,1756.0,2018-11-05,2.0,0
3,1,1250.0,2018-11-06,2.0,0
4,1,1324.0,2018-11-12,2.0,0
...,...,...,...,...,...
18854,1000,1729.0,2019-07-01,3.0,0
18855,1000,1527.0,2019-07-10,3.0,0
18856,1000,1254.0,2019-07-10,3.0,0
18857,1000,1356.0,2019-07-12,3.0,0
18858,1000,1219.0,2019-07-13,3.0,0

In [96]:
missing = df_customer.isna().sum()

print(missing)

customer_id       0
last_name         0
first_name        0
DOB               0
city              0
state           300
country_name      0
gender            0
dtype: int64

In [97]:
missing = df_streams.isna().sum()

print(missing)

customer_id             0
stream_id               0
date                    0
invoice_item_id         0
subscription_stopped    0
dtype: int64

In [98]:
# For this example, the two most convenient structures for this task are Pandas dataframes and NumPy arrays. 
# At a minimum ensure that your structure accommodates the following.

# 1. A column for customer_id
# 2. A column for country
# 3. A column for age that is created from DOB
# 4. A column customer_name that is created from first_name and last_name
# 5. A column to indicate churn called is_subscriber
# 6. A column that indicates subscriber_type that comes from invoice_item
# 7. A column to indicate the total num_streams

In [99]:
# merge 2 datasets
df_merged = pd.merge(df_customer, df_streams, on="customer_id", how="left")
df_merged

,customer_id,last_name,first_name,DOB,city,state,country_name,gender,stream_id,date,invoice_item_id,subscription_stopped
0,1,Todd,Kasen,07/30/98,Rock Hill,South Carolina,united_states,m,1420.0,2018-10-21,2.0,0
1,1,Todd,Kasen,07/30/98,Rock Hill,South Carolina,united_states,m,1343.0,2018-10-23,2.0,0
2,1,Todd,Kasen,07/30/98,Rock Hill,South Carolina,united_states,m,1756.0,2018-11-05,2.0,0
3,1,Todd,Kasen,07/30/98,Rock Hill,South Carolina,united_states,m,1250.0,2018-11-06,2.0,0
4,1,Todd,Kasen,07/30/98,Rock Hill,South Carolina,united_states,m,1324.0,2018-11-12,2.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
17690,1000,Solis,Cole,07/07/99,Brockton,Massachusetts,united_states,m,1729.0,2019-07-01,3.0,0
17691,1000,Solis,Cole,07/07/99,Brockton,Massachusetts,united_states,m,1527.0,2019-07-10,3.0,0
17692,1000,Solis,Cole,07/07/99,Brockton,Massachusetts,united_states,m,1254.0,2019-07-10,3.0,0
17693,1000,Solis,Cole,07/07/99,Brockton,Massachusetts,united_states,m,1356.0,2019-07-12,3.0,0
17694,1000,Solis,Cole,07/07/99,Brockton,Massachusetts,united_states,m,1219.0,2019-07-13,3.0,0

In [100]:
# check DOB data type
df_merged["DOB"].dtype

dtype('O')

In [101]:
# convert DOB 
from datetime import date

df_merged["DOB"] = pd.to_datetime(df_merged["DOB"], errors="coerce")

df_merged["DOB"].head()

C:\Users\Maryam\AppData\Local\Temp\ipykernel_6856\3749963173.py:4: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_merged["DOB"] = pd.to_datetime(df_merged["DOB"], errors="coerce")

0   1998-07-30
1   1998-07-30
2   1998-07-30
3   1998-07-30
4   1998-07-30
Name: DOB, dtype: datetime64[ns]

In [102]:
# create derived columns, like age from DOB

df_merged["age"] = date.today().year - df_merged["DOB"].dt.year
df_merged["age"]

0        28
1        28
2        28
3        28
4        28
         ..
17690    27
17691    27
17692    27
17693    27
17694    27
Name: age, Length: 17695, dtype: int32

In [103]:
# create customer_name
df_merged["customer_name"] = df_merged["first_name"] + " " + (df_merged["last_name"])

df_merged["customer_name"]

0        Kasen Todd
1        Kasen Todd
2        Kasen Todd
3        Kasen Todd
4        Kasen Todd
            ...
17690    Cole Solis
17691    Cole Solis
17692    Cole Solis
17693    Cole Solis
17694    Cole Solis
Name: customer_name, Length: 17695, dtype: object

In [104]:
# churn / subscription status

df_merged["is_subscriber"] = df_merged["subscription_stopped"].map({
    0: False,
    1: True
}).astype('boolean')

print(df_merged["is_subscriber"])

0        False
1        False
2        False
3        False
4        False
         ...
17690    False
17691    False
17692    False
17693    False
17694    False
Name: is_subscriber, Length: 17695, dtype: boolean

In [129]:
# subscriber type

df_invoice = pd.read_sql_query("""
                                SELECT 
        i.customer_id,
        it.invoice_item AS subscriber_type
    FROM invoice_item it
    JOIN invoice i
        ON it.invoice_item_id = i.invoice_item_id
        """, conn)

df_invoice

     customer_id   subscriber_type
0              4      aavail_basic
1              7      aavail_basic
2             10      aavail_basic
3             14      aavail_basic
4             16      aavail_basic
..           ...               ...
995          994  aavail_unlimited
996          996  aavail_unlimited
997          998  aavail_unlimited
998          999  aavail_unlimited
999         1000  aavail_unlimited

[1000 rows x 2 columns]

In [130]:
# get total num_streams

streams_count = (
    df_streams.groupby("customer_id").size().reset_index(name="num_streams")
)

streams_count

     customer_id  num_streams
0              1           23
1              2           12
2              3           22
3              4           19
4              5           23
..           ...          ...
995          996           14
996          997           24
997          998           17
998          999           16
999         1000           18

[1000 rows x 2 columns]

In [131]:
# merge final result

df_final = pd.merge(
    df_merged,
    df_invoice,
    on="customer_id",
    how="left"
)

df_final.head()

,customer_id,last_name,first_name,DOB,city,state,country_name,gender,stream_id,date,invoice_item_id,subscription_stopped,age,customer_name,is_subscriber,subscriber_type
0,1,Todd,Kasen,1998-07-30,Rock Hill,South Carolina,united_states,m,1420.0,2018-10-21,2.0,0,28,Kasen Todd,False,aavail_premium
1,1,Todd,Kasen,1998-07-30,Rock Hill,South Carolina,united_states,m,1343.0,2018-10-23,2.0,0,28,Kasen Todd,False,aavail_premium
2,1,Todd,Kasen,1998-07-30,Rock Hill,South Carolina,united_states,m,1756.0,2018-11-05,2.0,0,28,Kasen Todd,False,aavail_premium
3,1,Todd,Kasen,1998-07-30,Rock Hill,South Carolina,united_states,m,1250.0,2018-11-06,2.0,0,28,Kasen Todd,False,aavail_premium
4,1,Todd,Kasen,1998-07-30,Rock Hill,South Carolina,united_states,m,1324.0,2018-11-12,2.0,0,28,Kasen Todd,False,aavail_premium

In [132]:
df_final = pd.merge(
    df_final,
    streams_count,
    on="customer_id",
    how="left"
)

df_final.head()

,customer_id,last_name,first_name,DOB,city,state,country_name,gender,stream_id,date,invoice_item_id,subscription_stopped,age,customer_name,is_subscriber,subscriber_type,num_streams
0,1,Todd,Kasen,1998-07-30,Rock Hill,South Carolina,united_states,m,1420.0,2018-10-21,2.0,0,28,Kasen Todd,False,aavail_premium,23
1,1,Todd,Kasen,1998-07-30,Rock Hill,South Carolina,united_states,m,1343.0,2018-10-23,2.0,0,28,Kasen Todd,False,aavail_premium,23
2,1,Todd,Kasen,1998-07-30,Rock Hill,South Carolina,united_states,m,1756.0,2018-11-05,2.0,0,28,Kasen Todd,False,aavail_premium,23
3,1,Todd,Kasen,1998-07-30,Rock Hill,South Carolina,united_states,m,1250.0,2018-11-06,2.0,0,28,Kasen Todd,False,aavail_premium,23
4,1,Todd,Kasen,1998-07-30,Rock Hill,South Carolina,united_states,m,1324.0,2018-11-12,2.0,0,28,Kasen Todd,False,aavail_premium,23

In [135]:
# generate 1 column per customer

df_final_grouped = df_final.groupby(
    ["customer_id", "country_name", "age", "customer_name", "is_subscriber", "subscriber_type"],
    as_index=False
).agg(num_streams=("num_streams", "max"))

df_final_grouped

,customer_id,country_name,age,customer_name,is_subscriber,subscriber_type,num_streams
0,1,united_states,28,Kasen Todd,False,aavail_premium,23
1,2,singapore,37,Ensley Garza,False,aavail_unlimited,12
2,2,singapore,37,Ensley Garza,True,aavail_unlimited,12
3,3,united_states,29,Lillian Carey,False,aavail_premium,22
4,3,united_states,29,Lillian Carey,True,aavail_premium,22
...,...,...,...,...,...,...,...
1270,996,singapore,-38,Peyton Enriquez,True,aavail_unlimited,14
1271,997,united_states,30,Amina Manning,False,aavail_basic,24
1272,998,united_states,31,Brooks Ventura,False,aavail_unlimited,17
1273,999,united_states,46,Nayeli Mathis,False,aavail_unlimited,16
1274,1000,united_states,27,Cole Solis,False,aavail_unlimited,18

In [136]:
# combined data as a CSV file

df_final_grouped.to_csv(os.path.join(data_dir, "aavail_combined.csv"), index=False)

In [1]:
# From the code above create a function or class that performs all of the steps given a database file and a streams CSV file.
import os
import pandas as pd
import numpy as np
import sqlite3
from datetime import date

def ingest_data(db_file, streams_csv):

    # 1. connect to databse
    conn = sqlite3.connect(db_file)

    # 2. read customer data
    df_customer = pd.read_sql_query("SELECT cu.customer_id, cu.last_name, cu.first_name, cu.DOB, cu.City, cu.State, " + 
                                "co.country_name, cu.gender FROM CUSTOMER as cu JOIN COUNTRY as co ON cu.country_id = co.country_id", conn)

    # 3. read invoice / subscriber type
    df_invoice = pd.read_sql_query("""
                                SELECT 
                                i.customer_id,
                                it.invoice_item AS subscriber_type
                            FROM invoice_item it
                            JOIN invoice i
                                ON it.invoice_item_id = i.invoice_item_id
                                """, conn)

    # 4. read streams CSV
    df_streams = pd.read_csv(streams_csv)

    # 5. quality checks
    #    - drop duplicates
    df_customer = df_customer.drop_duplicates(subset="customer_id", keep="first")

    #    - drop missing stream_id
    df_streams = df_streams[df_streams["stream_id"].notna()]

    # 6. merge datasets
    df_merged = pd.merge(df_customer, df_streams, on="customer_id", how="left")

    # 7. derived columns
    #    - age
    df_merged["DOB"] = pd.to_datetime(df_merged["DOB"], errors="coerce")
    df_merged["age"] = date.today().year - df_merged["DOB"].dt.year

    #    - customer_name
    df_merged["customer_name"] = df_merged["first_name"] + " " + (df_merged["last_name"])

    #    - is_subscriber
    df_merged["is_subscriber"] = df_merged["subscription_stopped"].map({
        0: False,
        1: True
    }).astype('boolean')

    # 8. count streams per customer
    streams_count = (
        df_streams.groupby("customer_id").size().reset_index(name="num_streams")
    )

    # 9. final grouping
    df_final = pd.merge(
        df_merged,
        df_invoice,
        on="customer_id",
        how="left"
    )

    df_final = pd.merge(
        df_final,
        streams_count,
        on="customer_id",
        how="left"
    )

    df_final_grouped = df_final.groupby(
        ["customer_id", "country_name", "age", "customer_name", "is_subscriber", "subscriber_type"],
        as_index=False
    ).agg(num_streams=("num_streams", "max"))

    return df_final_grouped

In [2]:
data_dir = os.path.join("..", "data")
df_full = ingest_data(
    os.path.join(data_dir, "aavail-customers.db"),
    os.path.join(data_dir, "aavail-streams.csv")
)
df_full

C:\Users\Maryam\AppData\Local\Temp\ipykernel_16148\2745513594.py:42: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_merged["DOB"] = pd.to_datetime(df_merged["DOB"], errors="coerce")

,customer_id,country_name,age,customer_name,is_subscriber,subscriber_type,num_streams
0,1,united_states,28,Kasen Todd,False,aavail_premium,23
1,2,singapore,37,Ensley Garza,False,aavail_unlimited,12
2,2,singapore,37,Ensley Garza,True,aavail_unlimited,12
3,3,united_states,29,Lillian Carey,False,aavail_premium,22
4,3,united_states,29,Lillian Carey,True,aavail_premium,22
...,...,...,...,...,...,...,...
1270,996,singapore,-38,Peyton Enriquez,True,aavail_unlimited,14
1271,997,united_states,30,Amina Manning,False,aavail_basic,24
1272,998,united_states,31,Brooks Ventura,False,aavail_unlimited,17
1273,999,united_states,46,Nayeli Mathis,False,aavail_unlimited,16
1274,1000,united_states,27,Cole Solis,False,aavail_unlimited,18

In [5]:
# Create customer ID batches

import numpy as np

batch_size = 500

customer_ids = df_full["customer_id"].unique()

batchs = np.array_split(customer_ids, len(customer_ids) // batch_size + 1)

batchs

[array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
         14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
         27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
         40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
         53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
         66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
         79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
         92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
        105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
        118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
        131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
        144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156,
        157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
        170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
        183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195,
        196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208,
        209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221,
        222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234,
        235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247,
        248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260,
        261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273,
        274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286,
        287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299,
        300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312,
        313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325,
        326, 327, 328, 329, 330, 331, 332, 333, 334]),
 array([335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347,
        348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360,
        361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373,
        374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386,
        387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399,
        400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412,
        413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425,
        426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438,
        439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451,
        452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464,
        465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477,
        478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490,
        491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503,
        504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516,
        517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529,
        530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542,
        543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555,
        556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568,
        569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581,
        582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594,
        595, 596, 597, 598, 599, 600, 601, 602, 603, 604, 605, 606, 607,
        608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619, 620,
        621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632, 633,
        634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 645, 646,
        647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659,
        660, 661, 662, 663, 664, 665, 666, 667]),
 array([ 668,  669,  670,  671,  672,  673,  674,  675,  676,  677,  678,
         679,  680,  681,  682,  683,  684,  685,  686,  687,  688,  689,
         690,  691,  692,  693,  694,  695,  696,  697,  698,  699,  700,
         701,  702,  703,  704,  705,  706,  707,  708,  709,  710,  711,
         712,  713,  714,  715,  716,  717,  718,  719,  720,  721,  722,
         723,  724,  725,  726,  727,  728,  729,  730,  731,  732,  733,
         734,  735,  736,  737,  738,  739,  740,  741,  742,  743,  744,
         745,  746,  747,  748,  749,  750,  751,  752,  753,  754,  755,
         756,  757,  758,  759,  760,  761,  762,  763,  764,  765,  766,
         767,  768,  769,  770,  771,  772,  773,  774,  775,  776,  777,
         778,  779,  780,  781,  782,  783,  784,  785,  786,  787,  788,
         789,  790,  791,  792,  793,  794,  795,  796,  797,  798,  799,
         800,  801,  802,  803,  804,  805,  806,  807,  808,  809,  810,
         811,  812,  813,  814,  815,  816,  817,  818,  819,  820,  821,
         822,  823,  824,  825,  826,  827,  828,  829,  830,  831,  832,
         833,  834,  835,  836,  837,  838,  839,  840,  841,  842,  843,
         844,  845,  846,  847,  848,  849,  850,  851,  852,  853,  854,
         855,  856,  857,  858,  859,  860,  861,  862,  863,  864,  865,
         866,  867,  868,  869,  870,  871,  872,  873,  874,  875,  876,
         877,  878,  879,  880,  881,  882,  883,  884,  885,  886,  887,
         888,  889,  890,  891,  892,  893,  894,  895,  896,  897,  898,
         899,  900,  901,  902,  903,  904,  905,  906,  907,  908,  909,
         910,  911,  912,  913,  914,  915,  916,  917,  918,  919,  920,
         921,  922,  923,  924,  925,  926,  927,  928,  929,  930,  931,
         932,  933,  934,  935,  936,  937,  938,  939,  940,  941,  942,
         943,  944,  945,  946,  947,  948,  949,  950,  951,  952,  953,
         954,  955,  956,  957,  958,  959,  960,  961,  962,  963,  964,
         965,  966,  967,  968,  969,  970,  971,  972,  973,  974,  975,
         976,  977,  978,  979,  980,  981,  982,  983,  984,  985,  986,
         987,  988,  989,  990,  991,  992,  993,  994,  995,  996,  997,
         998,  999, 1000])]

In [7]:
# Run ingestion per batch

df_batches = []

for batch_ids in batchs:
    df_batch = ingest_data(
        os.path.join(data_dir, "aavail-customers.db"),
        os.path.join(data_dir, "aavail-streams.csv")
    )

    df_batch = df_batch[df_batch["customer_id"].isin(batch_ids)]
    df_batches.append(df_batch)

C:\Users\Maryam\AppData\Local\Temp\ipykernel_16148\2745513594.py:42: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_merged["DOB"] = pd.to_datetime(df_merged["DOB"], errors="coerce")
C:\Users\Maryam\AppData\Local\Temp\ipykernel_16148\2745513594.py:42: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_merged["DOB"] = pd.to_datetime(df_merged["DOB"], errors="coerce")
C:\Users\Maryam\AppData\Local\Temp\ipykernel_16148\2745513594.py:42: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_merged["DOB"] = pd.to_datetime(df_merged["DOB"], errors="coerce")

In [8]:
df_batched = pd.concat(df_batches, ignore_index=True)
df_batched

,customer_id,country_name,age,customer_name,is_subscriber,subscriber_type,num_streams
0,1,united_states,28,Kasen Todd,False,aavail_premium,23
1,2,singapore,37,Ensley Garza,False,aavail_unlimited,12
2,2,singapore,37,Ensley Garza,True,aavail_unlimited,12
3,3,united_states,29,Lillian Carey,False,aavail_premium,22
4,3,united_states,29,Lillian Carey,True,aavail_premium,22
...,...,...,...,...,...,...,...
1270,996,singapore,-38,Peyton Enriquez,True,aavail_unlimited,14
1271,997,united_states,30,Amina Manning,False,aavail_basic,24
1272,998,united_states,31,Brooks Ventura,False,aavail_unlimited,17
1273,999,united_states,46,Nayeli Mathis,False,aavail_unlimited,16
1274,1000,united_states,27,Cole Solis,False,aavail_unlimited,18

In [11]:
sort_cols = [
    "customer_id",
    "country_name",
    "age",
    "customer_name",
    "is_subscriber",
    "subscriber_type",
    "num_streams"
]

df_full_sorted = df_full.sort_values(sort_cols).reset_index(drop=True)
df_batched_sorted = df_batched.sort_values(sort_cols).reset_index(drop=True)
df_full_sorted

,customer_id,country_name,age,customer_name,is_subscriber,subscriber_type,num_streams
0,1,united_states,28,Kasen Todd,False,aavail_premium,23
1,2,singapore,37,Ensley Garza,False,aavail_unlimited,12
2,2,singapore,37,Ensley Garza,True,aavail_unlimited,12
3,3,united_states,29,Lillian Carey,False,aavail_premium,22
4,3,united_states,29,Lillian Carey,True,aavail_premium,22
...,...,...,...,...,...,...,...
1270,996,singapore,-38,Peyton Enriquez,True,aavail_unlimited,14
1271,997,united_states,30,Amina Manning,False,aavail_basic,24
1272,998,united_states,31,Brooks Ventura,False,aavail_unlimited,17
1273,999,united_states,46,Nayeli Mathis,False,aavail_unlimited,16
1274,1000,united_states,27,Cole Solis,False,aavail_unlimited,18

In [17]:
print(df_full_sorted.equals(df_batched_sorted))

True